; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v9 ?v8)
             (pred_6 ?v3 ?v7)
             (pred_10 ?v9 ?v7)
             (pred_5 ?v2 ?v9 )
	     (pred_11 ?v9)
             (pred_12 ?v10)
             (pred_4 ?v3)
             (pred_8 ?v7)
             (pred_9 ?v9)
             (pred_1 ?v3)
             (pred_7 ?v9)
             (pred_2 ))



(:action op_3
:parameters (?v11 ?v13 ?v5 ?v4)
:precondition (and (pred_12 ?v11) (pred_12 ?v13) (pred_4 ?v5) (pred_8 ?v4)
          (pred_3 ?v11 ?v13) (pred_6 ?v5 ?v4)
                   (pred_10 ?v13 ?v4) (pred_11 ?v11) 
                   (pred_9 ?v13) (pred_1 ?v5))
:effect (and  (pred_7 ?v13) (not (pred_9 ?v13))))


(:action op_4
:parameters (?v11 ?v1)
:precondition (and (pred_12 ?v11) (pred_12 ?v1)
               (pred_11 ?v11) (pred_3 ?v11 ?v1) (pred_7 ?v1))
:effect (and (pred_11 ?v1) (not (pred_11 ?v11))))

(:action op_2
:parameters (?v11 ?v5)
:precondition (and (pred_12 ?v11) (pred_4 ?v5) 
                  (pred_11 ?v11) (pred_5 ?v5 ?v11) (pred_2 ))
:effect (and (pred_1 ?v5)
   (not (pred_5 ?v5 ?v11)) (not (pred_2 ))))


(:action op_1
:parameters (?v11 ?v6 ?v12)
:precondition (and (pred_12 ?v11) (pred_4 ?v6) (pred_4 ?v12)
                  (pred_11 ?v11) (pred_1 ?v12) (pred_5 ?v6 ?v11))
:effect (and (pred_1 ?v6) (pred_5 ?v12 ?v11)
        (not (pred_1 ?v12)) (not (pred_5 ?v6 ?v11))))

(:action op_5
:parameters (?v11 ?v5)
:precondition (and (pred_12 ?v11) (pred_4 ?v5) 
                  (pred_11 ?v11) (pred_1 ?v5))
:effect (and (pred_2 ) (pred_5 ?v5 ?v11) (not (pred_1 ?v5)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_21 obj_17 obj_07 obj_12 obj_08 obj_16 obj_14 obj_10 obj_04 obj_11 obj_01 obj_02 obj_15 obj_09 obj_06 obj_05
    obj_18 obj_13
    obj_20 obj_19 obj_03
    )

    (:init
       (pred_2)

       (pred_12 obj_21)
       (pred_12 obj_17)
       (pred_12 obj_07)
       (pred_12 obj_12)
       (pred_12 obj_08)
       (pred_12 obj_16)
       (pred_12 obj_14)
       (pred_12 obj_10)
       (pred_12 obj_04)
       (pred_12 obj_11)
       (pred_12 obj_01)
       (pred_12 obj_02)
       (pred_12 obj_15)
       (pred_12 obj_09)
       (pred_12 obj_06)
       (pred_12 obj_05)
       (pred_8 obj_18)
       (pred_8 obj_13)
       (pred_4 obj_20)
       (pred_4 obj_19)
       (pred_4 obj_03)

       (pred_3 obj_21 obj_08)
       (pred_3 obj_21 obj_17)
       (pred_3 obj_17 obj_16)
       (pred_3 obj_17 obj_07)
       (pred_3 obj_17 obj_21)
       (pred_3 obj_07 obj_14)
       (pred_3 obj_07 obj_12)
       (pred_3 obj_07 obj_17)
       (pred_3 obj_12 obj_10)
       (pred_3 obj_12 obj_07)
       (pred_3 obj_08 obj_04)
       (pred_3 obj_08 obj_16)
       (pred_3 obj_08 obj_21)
       (pred_3 obj_16 obj_11)
       (pred_3 obj_16 obj_14)
       (pred_3 obj_16 obj_17)
       (pred_3 obj_16 obj_08)
       (pred_3 obj_14 obj_01)
       (pred_3 obj_14 obj_10)
       (pred_3 obj_14 obj_07)
       (pred_3 obj_14 obj_16)
       (pred_3 obj_10 obj_02)
       (pred_3 obj_10 obj_12)
       (pred_3 obj_10 obj_14)
       (pred_3 obj_04 obj_15)
       (pred_3 obj_04 obj_11)
       (pred_3 obj_04 obj_08)
       (pred_3 obj_11 obj_09)
       (pred_3 obj_11 obj_01)
       (pred_3 obj_11 obj_16)
       (pred_3 obj_11 obj_04)
       (pred_3 obj_01 obj_06)
       (pred_3 obj_01 obj_02)
       (pred_3 obj_01 obj_14)
       (pred_3 obj_01 obj_11)
       (pred_3 obj_02 obj_05)
       (pred_3 obj_02 obj_10)
       (pred_3 obj_02 obj_01)
       (pred_3 obj_15 obj_09)
       (pred_3 obj_15 obj_04)
       (pred_3 obj_09 obj_06)
       (pred_3 obj_09 obj_11)
       (pred_3 obj_09 obj_15)
       (pred_3 obj_06 obj_05)
       (pred_3 obj_06 obj_01)
       (pred_3 obj_06 obj_09)
       (pred_3 obj_05 obj_02)
       (pred_3 obj_05 obj_06)
       (pred_9 obj_15)
       (pred_9 obj_12)
       (pred_9 obj_17)
       (pred_10  obj_15 obj_18)
       (pred_10  obj_12 obj_13)
       (pred_10  obj_17 obj_13)
       (pred_7 obj_21)
       (pred_7 obj_07)
       (pred_7 obj_08)
       (pred_7 obj_16)
       (pred_7 obj_14)
       (pred_7 obj_10)
       (pred_7 obj_04)
       (pred_7 obj_11)
       (pred_7 obj_01)
       (pred_7 obj_02)
       (pred_7 obj_09)
       (pred_7 obj_06)
       (pred_7 obj_05)

       (pred_6  obj_20 obj_18)
       (pred_6  obj_19 obj_13)
       (pred_6  obj_03 obj_13)
       (pred_5 obj_20 obj_06)
       (pred_5 obj_19 obj_16)
       (pred_5 obj_03 obj_08)
       (pred_11 obj_11)
    )

    (:goal (and
       (pred_5 obj_19 obj_10)
    ))
(:constraints
  (always (not (pred_11 obj_14)))
)
)

; plan
1. (op_4 obj_11 obj_16)
   deleted: (pred_11 obj_11)
   added: (pred_11 obj_16)
   goals met: 0 of 1
2. (op_2 obj_16 obj_19)
   deleted: (pred_5 obj_19 obj_16) (pred_2)
   added: (pred_1 obj_19)
   goals met: 0 of 1
3. (op_4 obj_16 obj_11)
   deleted: (pred_11 obj_16)
   added: (pred_11 obj_11)
   goals met: 0 of 1
4. (op_4 obj_11 obj_01)
   deleted: (pred_11 obj_11)
   added: (pred_11 obj_01)
   goals met: 0 of 1
5. (op_4 obj_01 obj_02)
   deleted: (pred_11 obj_01)
   added: (pred_11 obj_02)
   goals met: 0 of 1
6. (op_4 obj_02 obj_10)
   deleted: (pred_11 obj_02)
   added: (pred_11 obj_10)
   goals met: 0 of 1
7. (op_5 obj_10 obj_19)
   deleted: (pred_1 obj_19)
   added: (pred_2) (pred_5 obj_19 obj_10)
   goals met: 1 of 1
